/*
Species
    name
    description
    personality
    physical description
    homeworlds
    exampleNames
    adventures
    speciesTraits
        size
        speedText
        speed       (integer representing the number of squares)
        misc (array)
            heading (Heading of the additional section)
            body (body of the additional section)
----------TEMPLATE----------
{name : ,
 dsecription : ,
 personality : ,
 physicalDescription : ,
 homeworlds : ,
 languages : ,
 exampleNames : ,
 adventures : ,
 speciesTraits : {
    size : ,
    speedText : ,
    speed : ,
    misc : [
        {heading : ,
         body : }
    ]
 }
}
*/

var species = [{name: "Humans",
                description : "Humans dominate the Core Worlds and can be found in virtually every corner of the galaxy. They are the ancestors of early spacefaring pioneers, conquerors, traders, travelers, and refugees. Humans have always been people on the move. As a result, they can be found on almost every inhabited planet. As a species, Humans are physically, culturally, and politically diverse. Hardy or fine, light-skinned or dark, Humans remain one of the most dominant species throughout all eras of play.",
                personality : "Human personality runs the gamut of possibilities, though members of this species tend to be highly adaptable, tenacious, and willing to keep striving no matter the odds. They are flexible and ambitious, diverse in their tastes, morals, customs, and habits. ",
                physicalDescription : "Humans average about 1.8 meters tall. Skin shades run from nearly black to very pale, hair from black to blond. Men are usually taller and heavier than women. Humans achieve maturity about the age of 15 and rarely live beyond 100.",
                homeworlds : "Various, including Coruscant, Corellia, Naboo, Tatooine, and Alderaan.",
                languages : "Humans speak, read, and write Basic. They often learn other languages as well, including obscure ones.",
                exampleNames : "Anakin, Arani, Bail, Ben, Beru, Biggs, Boba, Corran, Dack, Dane, Galak, Garm, Han, Jango, Jodo, Lando, Leia, Luke, Mace, Mara, Obi-Wan, Owen, Padme, Qui-Gon, Sia-Lan, Rann, Talon, Vor'en, Wedge, Winter.",
                adventures : "Humans aren't afraid to try anything, and Human adventurers are the most audacious, daring, and ambitious members of an audacious, daring, and ambitious species. A Human can earn glory by amassing power, weath, and fame. More than any other species, Humans champion causes rather than territories or groups.",
                speciesTraits : {
                size : "Medium",
                speed : "Human base speed is six squares.",
                speedInSquares : 6,
                misc : [{heading : "Bonus Trained Skill", body : "Humans are versatile and accomplished at many tasks. A Human character chooses one additional trained skill at 1st level."}]
                },
                { name : "Blood Carver",
                description : "Blood Carvers are a mysterious race rarely seen outsid their homeworld of Batorine. Those that leave, however, do so because they have been exiled. They gravitate tword the finnges of society because the Blood Carvers' reputation for being fearsome assassins. Except for exiles, Blood Carvers rarely act alone, and exiles find new tribes (often like-minded members of other species) to associate with. Freed from cultural restrictions, Blood Carvers seek out personal wealth, but most are content to get by with a moderate amount of comfort.",
                personality : "on Batorine, Blood Carvers are fiercely loyal to their tribes and tribal leaders. Those who venture into the galaxy carry vestiges of this loyalty, transfering it to new allies made away from their home planet. Blood Carvers are unusually disdainful of material wealth and egotism, and find flattery and excess offensive. Blood Carvers strive to stamp out such traits, and some Blood Carvers are exiled from Batorine for showing hints of greed, gluttony, or pride.",
                physicalDescription : "Vaguely humanoid with golden skin, beaklike noses, and dark eyes, Blood Carvers are taller than Humans, despite their triple-segmented legs, Blood Carvers wear space, close-fitting clothing that allows them to move about with relative quiet, and they rarely, if ever, adorn themselves with jewelry. Tribal tatoos are common on Blood Carvers",
                homeworlds : "Batorine is a temprate world in the Colonies region. Blood Carvers also maintain colonies on friendly worlds, including Coruscant and Alderaan, and pocket colonies of exiles have popped up on more distant worlds such as Nar Shaddaa",
                languages : "Blood Carvers speak Batorese, a language that uses skin coloration and pheromones in addition to its verbal component. Non-Blood Carvers cannot speak or understand Batorese due to the complexities of the language, but Blood Carvers can also speak Basic.",
                exampleNames : "Ke, Daiv, Pa Gara, Mu Fiev, Va'Tosh",
                adventures : "Blood Carver adventures make excellent spies, assassins, and scouts. They gravitate tword the scout and scoundrel classes, though some are soldiers. Force sensitivity is not unknown among Blood Carvers, though few join the Jedi Order.",
                speciesTraits : {
                  abilityModifiers : "+2 Dexterity, -2 Wisdom, -2 Charisma. Blood Carvers are extremely agile but lack social skills.",
                  size : "Medium",
                  speed : "As Medium creatures, Blood Carvers have no special bonuses or penalties due to size",
                  speedInSquares : 6,
                  misc : [{heading : "conditionalBonusFeat", body : "Blood Carvers who have Acrobatics as a trained skill gain Skill Focus (Acrobatics) as a bonus feat"},
                  {heading : "deathStrike", body: "Whenever a Blood Carver makes a melee attack against an opponent that is denied its Dexterity bonus to Reflex Defense, the Blood Carver's attack, if successful, deals +1 die of damage.",},
                  {heading :"  automaticLanguages", body : "Basic and Batorese" }]
                  }
                }
                }]
